app/views/weather/_form.html.erb

<%= f.label :category_name %> :
<%= f.collection_check_boxes :category_ids, Category.all, :id, :category_name %><br>
---
SELECT "categories".* FROM "categories"