app/controllers/api/v1/weather_controller.rb

      def show
        # get all weather data belongs to category id, params[:id]
        weather = Category.find(params[:id]).weather_data
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]