app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @categoires = Category.all

INSERT INTO "categories" ("category_name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["category_name", "sri lanka"], ["created_at", 2017-01-03 10:05:29 UTC], ["updated_at", 2017-01-03 10:05:29 UTC]]
---
  def create
    @category = Category.new(category_parms)
    if @category.save

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 3]]
---
  def destroy
    @category = Category.find(params[:id])
    if @category.destroy

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "category_name" = $1, "updated_at" = $2 WHERE "categories"."id" = $3  [["category_name", "Sri lanka"], ["updated_at", 2017-01-03 11:06:43 UTC], ["id", 1]]
---
  def update
    @category = Category.find(params[:id])
    if @category.update_attributes(category_parms)